<template><div><h2 id="面向对象" tabindex="-1"><a class="header-anchor" href="#面向对象" aria-hidden="true">#</a> 面向对象：</h2>
<p>Object qriented programming</p>
<p>在面向对象的程序开发思想中，每一个对象都是功能中心，具有明确分工</p>
<p>面向对象变成具有灵活，代码可复用，容易维护和开发的特点，更适合多人合作的大型软件项目</p>
<h3 id="面向对象的作用" tabindex="-1"><a class="header-anchor" href="#面向对象的作用" aria-hidden="true">#</a> 面向对象的作用</h3>
<p>封装 继承 多态</p>
<p>面向对象是把事物分解为一个个对象，然后有对象之间分工合作</p>
<p>举个例子，把大象放进冰箱面向对象做法</p>
<p>先找出对象，并写出这些对象的功能</p>
<p>1.大象为对象</p>
<p>进去</p>
<p>2.冰箱对象</p>
<p>打开</p>
<p>关闭</p>
<p>3.使用大象和冰箱的功能</p>
<p>面向对象是以对象功能来划分问题，而不是步骤</p>
<h3 id="面向对象和面向过程的优缺点" tabindex="-1"><a class="header-anchor" href="#面向对象和面向过程的优缺点" aria-hidden="true">#</a> 面向对象和面向过程的优缺点</h3>
<p>面向过程</p>
<p>优点：性能比面向对象高，适合跟硬件联系很紧密的东西，例如单片机就采用面向过程</p>
<p>缺点：不如面向对象易维护，易复用，易扩展</p>
<p>面向对象优缺点相反，耦合高，更灵活，易维护</p>
<p>面向过程程序就像蛋炒饭</p>
<p>面向对象程序就像盖浇饭</p>
</div></template>
